a = input()
 
 
#a = '851201201502301501801204914038113013093520015014055200250150210522051802501501305'
#a = '85120120150 2301501801204 9140 381130 130935 200150 14055200 250150210 522051802501501305'
#a = '12345678910011012013014015016017018019020021022023024025026012100'
 
# 닥셔너리
di = {'1':'a', '2':'b', '3':'c', '4':'d', '5':'e',
'6':'f', '7':'g', '8':'h', '9':'i', '100':'j',
'110':'k', '120':'l', '130':'m', '140':'n', '150':'o',
'160':'p', '170':'q', '180':'r', '190':'s', '200':'t',
'210':'u', '220':'v', '230':'w', '240':'x', '250':'y',
'260':'z',' ':' '}
 
 
word = []
AA = ''
 
 
# 문자열 0 될떄까지 반복
while len(a)>0:
 
    # 4자리에서 0이 2개면
    if a[:4].count('0') == 2:
 
        # 앞 3자리가 100이나 200이면
        if a[:3] == '200' or a[:3]=='100':
            tmp = a[:3]
            word.append(tmp)
            a = a[3:]
 
        # 아니면 앞1자리 빼주고
        else:
            tmp = a[0]
            word.append(tmp)
            a = a[1:]
 
        # 뒤에 3자리 빼주고
            tmp = a[:3]
            word.append(tmp)
            a = a[3:]
 
    # 3자리중 0이 하나면
    elif a[:3].count('0') == 1:
        tmp = a[:3]
        word.append(tmp)
        a = a[3:]
 
    # 나머지 경우 1자리만 빼기
    else:
        tmp = a[0]
        word.append(tmp)
        a = a[1:]
 
 
 
# 나온 숫자 결합
 
for i in word:
    AA += di[i]
 
#AA = str(AA)
print(AA)